L = (['o' for i in range(36)])  # Доска игрока
Q = (['o' for k in range(36)])  # Доска ИИ
q = [1, 2]
n = 1
# доступные ходы на доске ИИ
allow_list_AI = {11, 12, 13, 14, 15, 16, 21, 22, 23, 24, 25, 26, 31, 32, 33, 34, 35, 36,41, 42, 43, 44, 45, 46,51,52,53,54,55,56,61,62,63,64,65,66}
# доступные ходы на доске игрока
allow_list_Pl = {11, 12, 13, 14, 15, 16, 21, 22, 23, 24, 25, 26, 31, 32, 33, 34, 35, 36,41, 42, 43, 44, 45, 46,51,52,53,54,55,56,61,62,63,64,65,66}
def paint():
    print(f"""          | 1 | 2 | 3 | 4 | 5 | 6|                    | 1 | 2 | 3 | 4 | 5 | 6|

        1 | {Q[0]} | {Q[1]} | {Q[2]} | {Q[3]} | {Q[4]} | {Q[5]} |                 1 | {L[0]} | {L[1]} | {L[2]} | {L[3]} | {L[4]} | {L[5]} |

        2 | {Q[6]} | {Q[7]} | {Q[8]} | {Q[9]} | {Q[10]} | {Q[11]} |                 2 | {L[6]} | {L[7]} | {L[8]} | {L[9]} | {L[10]} | {L[11]} |

        3 | {Q[12]} | {Q[13]} | {Q[14]} | {Q[15]} | {Q[16]} | {Q[17]} |                 3 | {L[12]} | {L[13]} | {L[14]} | {L[15]} | {L[16]} | {L[17]} |

        4 | {Q[18]} | {Q[19]} | {Q[20]} | {Q[21]} | {Q[22]} | {Q[23]} |                 4 | {L[18]} | {L[19]} | {L[20]} | {L[21]} | {L[22]} | {L[23]} |

        5 | {Q[24]} | {Q[25]} | {Q[26]} | {Q[27]} | {Q[28]} | {Q[29]} |                 5 | {L[24]} | {L[25]} | {L[26]} | {L[27]} | {L[28]} | {L[29]} |

        6 | {Q[30]} | {Q[31]} | {Q[32]} | {Q[33]} | {Q[34]} | {Q[35]} |                 6 | {L[30]} | {L[31]} | {L[32]} | {L[33]} | {L[34]} | {L[35]} |""")

def input_nump():  # ввод игрока
    global n

    a = int(input('введите номер строки '))
    b = int(input('введите номер столбца '))
    Q[b + 6 * a - 7] = 'T'  # отмечаем промах на доске
    allow_list_AI.remove(10 * a + b)  # удаляем координату хода из списка дозволенных ходов
def play():
    global n
    while True:
        if n % 2 == 1: # ходят пока-что по очереди, сначала человек
            input_nump()
            paint()
        else:
             input_numA()
             paint()
        n += 1

def input_numA():  # ввод ИИ
    global L
    import random
    shoot = random.choice(list(allow_list_Pl))
    Ox = shoot // 10
    Oy = shoot % 10
    L[Oy + 6 * Ox - 7] = 'T'
    allow_list_Pl.remove(shoot)  # удаляем координату хода из списка дозволенных ходов
play()
